In [16]:
import pandas as pd
import numpy as np
data = [['Ossama',25],['Ali',43],['Ziad',32]]
DF1 = pd.DataFrame(data,columns=['Name','Age'])
print (DF1)

     Name  Age
0  Ossama   25
1     Ali   43
2    Ziad   32

In [17]:
DF1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [18]:
data = [{'Test1': 10, 'Test2': 20},{'Test1': 30,'Test2': 20, 'Project': 20}]
df1 = pd.DataFrame(data, index=['First', 'Second'],columns=['Test2', 'Project' , 'Test1'])
df2 = pd.DataFrame(data, index=['First', 'Second'],columns=['Project', 'Test_1','Test2 '])
print (df1)
print ("\n")
print (df2)

        Test2  Project  Test1
First      20      NaN     10
Second     20     20.0     30


        Project  Test_1  Test2
First       NaN     NaN     NaN
Second     20.0     NaN     NaN

In [19]:
data = {'Test1' : pd.Series([70, 55, 89],index=['Ahmed', 'Omar', 'Ali']),
 'Test2' : pd.Series([56, 82, 77, 65],index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
df1 = pd.DataFrame(data)
print (df1)

       Test1  Test2
Ahmed   70.0     56
Ali     89.0     77
Omar    55.0     82
Salwa    NaN     65

In [20]:
df1['Project'] = pd.Series([90,83,67, 87],index=['Ali','Omar','Salwa', 'Ahmed'])
df1['Average'] = round((df1['Test1']+df1['Test2']+df1['Project'])/3, 2)
print (df1)
df2 = df1
print ("\n")
df2.pop('Project')
print (df2)

       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN


       Test1  Test2  Average
Ahmed   70.0     56    71.00
Ali     89.0     77    85.33
Omar    55.0     82    73.33
Salwa    NaN     65      NaN

In [21]:
print (df1[2:4])

       Test1  Test2  Average
Omar    55.0     82    73.33
Salwa    NaN     65      NaN

In [22]:
test = [95, 84, 55, 75]
marks = pd.Series(test)

s = pd.Series([99, 55, 66, 88])

NewSeries = pd.concat([s, marks], ignore_index=True)
print(NewSeries)

0    99
1    55
2    66
3    88
4    95
5    84
6    55
7    75
dtype: int64

In [23]:
import pandas as pd
data = {'Test1' : pd.Series([70, 55, 89], index=['Ahmed', 'Omar', 'Ali']),
        'Test2' : pd.Series([56, 82, 77, 65], 
index=['Ahmed', 'Omar', 'Ali', 'Salwa']),
'Project' : pd.Series([87, 83, 90, 67], 
index=['Ahmed', 'Omar', 'Ali', 'Salwa']),
'Average' : pd.Series([71, 73.33, 85.33, 66], 
index=['Ahmed', 'Omar', 'Ali', 'Salw'])}

In [24]:
data

{'Test1': Ahmed    70
 Omar     55
 Ali      89
 dtype: int64,
 'Test2': Ahmed    56
 Omar     82
 Ali      77
 Salwa    65
 dtype: int64,
 'Project': Ahmed    87
 Omar     83
 Ali      90
 Salwa    67
 dtype: int64,
 'Average': Ahmed    71.00
 Omar     73.33
 Ali      85.33
 Salw     66.00
 dtype: float64}

In [25]:
df1 = pd.DataFrame(data)

In [26]:
df2 = pd.DataFrame([[80, 70, 90, 80]], columns = ['Test1','Test2','Project','Average'], index=['Khalid'])
df1

       Test1  Test2  Project  Average
Ahmed   70.0   56.0     87.0    71.00
Ali     89.0   77.0     90.0    85.33
Omar    55.0   82.0     83.0    73.33
Salw     NaN    NaN      NaN    66.00
Salwa    NaN   65.0     67.0      NaN

In [28]:
df_combined = pd.concat([df1, df2], ignore_index=True)

df_combined

   Test1  Test2  Project  Average
0   70.0   56.0     87.0    71.00
1   89.0   77.0     90.0    85.33
2   55.0   82.0     83.0    73.33
3    NaN    NaN      NaN    66.00
4    NaN   65.0     67.0      NaN
5   80.0   70.0     90.0    80.00